
'''
学习整型变量。

包括整型变量的声明、加运算、减运算、乘运算、除运算、等
'''
a = 2 + 3

print(a)

a = 3 - 2

print(a)

a = 2 * 3

print(a)

# 这个运算与平常的其它语言不一样，不是1，而是1.5。
a = 3 / 2

print(a)

# 乘方运算，结果为9
a = 3 ** 2

print(a)

# 乘方运算，结果为27
a = 3 ** 3

print(a)

# 乘方运算，结果为1000000
a = 10 ** 6

print(a)

# 注意运算次序，结果为14
a = 2 + 3 * 4

print(a)

# 注意运算次序，结果为20
a = (2 + 3) * 4

print(a)

'''
浮点数
'''

# 浮点型与整型的加运算，结果为0.2
a = 0.1 + 0.1

print(a)

# 浮点型与整型的加运算，结果为0.4
a = 0.2 + 0.2

print(a)

# 浮点型与整型的乘运算
a = 2 * .1

print(a)

# 浮点型与整型的乘运算，结果正常。注意与下面的运算对比
a = 2 * .2

print(a)


# 浮点型的加运算，结果不是0.3
a = 0.2 + 0.1

print(a)

# 浮点型与整型的乘运算，结果不是0.3
a = 3 * 0.1

print(a)

# 结果为1.5
a = 3 / 2

print(a)

# 浮点型与整型的除运算，结果为1.5
a = 3.0 / 2

print(a)

# 取模，结果为1
a = 3 % 2

print(a)

age = 23

# 整型转换为字符串
message = "happy " + str(age) + "rd birthday"

print(message)

# 注释

